Repository: pikougi-nabot/epochrefs-old
Catalog: commit/84000/data-translation-memory/toh44-45_84000-the-stem-array.tmx/chapters-19-25.tmx
Source language: bo
Languages: en

source: དེ་དག་དེ་ལྟར་སྒྲ་འབྱིན་ཅིང་ཡིད་དུ་འོང་ལ་སྙན་པ་དང་། མཉན་ན་དགའ་བའི་དབྱངས་རྗོད་ཅིང་། རྒྱལ་པོ་འོད་ཆེན་པོ་གང་ན་བ་དེར་འདུད་ཏེ་ཕྱག་འཚལ་ལོ།
en: When they resounded, they emitted beautiful, delightful sounds, so that those people bowed and made obeisance in the direction of King Mahāprabha.

source: །གྲོང་ཁྱེར་ཆེན་པོ་འོད་བཟང་པོའི་ནང་ན། སེམས་ཅན་ཇི་སྙེད་ཅིག་གནས་པ་དེ་དག་ཐམས་ཅད་ཀྱང་། དགའ་བ་དང་རངས་པའི་སེམས་ཀྱིས་ཡོངས་སུ་རྒྱས་ནས། རྒྱལ་པོ་འོད་ཆེན་པོ་གང་ན་བ་དེར་ལོགས་སུ་མངོན་ཏུ་ལྟ་སྟེ། ལུས་ཐམས་ཅད་ཀྱིས་ཕབ་ཅིང་ཕྱག་འཚལ་ལོ།
en: All those beings who dwelled within the great city of Suprabha experienced increased happiness and joy, turned to face the direction of King Mahāprabha, and prostrated their entire bodies on the ground in homage.

source: །དེའི་ཁམས་ཀྱི་གྲོང་དང་གྲོང་ཁྱེར་དང་། ལྗོངས་དང་ཡུལ་དང་ཁམས་དང་། རྒྱལ་པོའི་ཕོ་བྲང་འཁོར་ན་གནས་པ་དེ་དག་ཐམས་ཅད་ཀྱང་ལུས་དང་སེམས་བདེ་བར་གྱུར་ཏེ། དགའ་ཞིང་རངས་པ་སྐྱེས་ནས། རྒྱལ་པོ་འོད་ཆེན་པོ་གང་ན་བ་དེ་ལོགས་སུ་ཕྱག་འཚལ་ལོ།
en: Those beings who lived in the villages, the towns, the marketplaces, the land, the kingdom, the capital, and its environs all became blissful in mind and body, and with happiness and joy they bowed down in the direction of King Mahāprabha.

source: །བྱོལ་སོང་གི་སྐྱེ་གནས་སུ་གཏོགས་པའི་སེམས་ཅན་དེ་དག་ཐམས་ཅད་ཀྱང་གཅིག་ལ་གཅིག་བྱམས་པའི་སེམས་དང་། ཕན་པའི་སེམས་སུ་ལྡན་པར་གྱུར་ནས།
en: The beings who had been reborn as animals all became kind toward one another and wished to help one another.

source: རྒྱལ་པོ་འོད་ཆེན་པོ་གང་ན་བ་དེར་ལོགས་སུ་ལྟ་ཞིང་མངོན་པར་འདུད་དོ།
en: They all turned to look in the direction of King Mahāprabha and bowed down to him.

source: །རི་དང་སྒངམཐོན་པོའི་སའི་ཕྱོགས་ཐམས་ཅད་ཀྱང་རྒྱལ་པོ་འོད་ཆེན་པོ་གང་ན་བདེར་མངོན་པར་འདུད་དོ།
en: Even the land, all the mountain peaks, and the other lofty lands bowed toward King Mahāprabha.

source: མེ་ཏོག་གི་ཤིང་དང་། འབྲས་བུའི་ཤིང་དང་། ལོ་མའི་ཤིང་དང་། ས་བོན་གྱི་ཚོགས་དང་། འབྱུང་བའི་ཚོགས་དང་། ལོ་ཏོག་དང་། ལྡུམ་བུ་དང་། རྩ་དང་གེལ་པ་དང་། སྨན་དང་ནགས་ཚལ་ཐམས་ཅད་ཀྱང་རྒྱལ་པོ་འོད་ཆེན་པོ་གང་ན་བ་དེ་ལོགས་སུ་ལྟ་ཞིང་མངོན་པར་འདུད་པར་གྱུར་ཏོ།
en: All the flowering trees, fruit trees, leafy trees, edible plants, vegetation, crops, grasses, bushes, herbs, and forests turned in the direction of King Mahāprabha and bowed down toward him.

source: །དེའི་ཁམས་ན་མཚོ་དང་། མཚེའུ་དང་། ལུ་མ་དང་། ལྡེང་ཀ་དང་། འབབ་ཆུ་དང་། ཆུ་ཀླུང་དང་། རྫིང་དང་། ཁྲོན་པ་ཇི་སྙེད་པ་དེ་དག་ཐམས་ཅད་ཀྱང་རྒྱལ་པོ་འོད་ཆེན་པོ་གང་ན་བ་དེ་ལོགས་སུ་མངོན་པར་གཞོལ་ཞིང་རླབས་ཀྱི་སྒྲ་འབྱིན་པར་གྱུར་ཏོ།
en: All the springs, lakes, ponds, reservoirs, waterfalls, rivers, lotus ponds, and wells in his realm turned and made the sounds of flowing in the direction of King Mahāprabha.

source: །ཀླུའི་རྒྱལ་པོ་སྟོང་ཕྲག་བཅུ་ཡང་། ཨ་ག་རུ་ནག་པོའི་བདུག་སྤོས་ཀྱི་དུད་པ་ན་བུན་དུ་འགྲིགས་པའི་སྤོས་ཀྱི་སྤྲིན་ལས་གློག་སྣ་ཚོགས་འགྱུ་བའི་འོད་ཀྱི་སྣང་བར་བྱེད་ཅིང་། འབྲུག་སྒྲ་སྒྲོག་པ་དང་། སྤོས་ཆུའི་ཆར་གྱི་རྒྱུན་ཤིན་ཏུ་ཕྲ་བ་མངོན་པར་འབེབས་པར་གྱུར་ཏོ།
en: Ten thousand nāga kings caused a mass of smoke of great black-agarwood incense to form a cloud of perfume, from which came the illumination of bright streaks of lightning, the roar of thunder, and a fine rain of perfumed water that fell in all four directions.

source: །བརྒྱ་བྱིན་དང་རབ་མཚེ་མ་དང་དགའ་ལྡན་དང་། རབ་འཕྲུལ་དགའ་དང་། དབང་བསྒྱུར་གྱི་ལྷའི་རྒྱལ་པོ་ལ་སྩོགས་པ་ལྷའི་བུ་སྟོང་ཕྲག་བཅུས་ཀྱང་སྟེང་གི་བར་སྣང་ལ་འཁོད་དེ་ནམ་མཁའི་དབྱིངས་ཐམས་ཅད་ལྷ་རྫས་ཀྱི་རོལ་མོ་སིལ་སྙན་གྱི་སྤྲིན་བྱེ་བ་ཁྲག་ཁྲིག་བརྒྱ་སྟོང་གི་སྒྲ་ཕྱུང་བས་དབྱངས་སྙན་པ་རྒྱ་ཆེར་བསྒྲགས་པའི་རྒྱན་གྱིས་བརྒྱན་པ་དང་། ལྷའི་བུ་མོ་གྲངས་མེད་པ་ལྷའི་གླུ་སྙན་པ་ལེན་པའི་སྤྲིན་གྱི་སྒྲ་བསྒྲགས་པའི་དབྱངས་སྙན་ཅིང་ཡིད་དུ་འོང་བའི་རྒྱན་གྱིས་བརྒྱན་པ་དང་། ལྷ་རྫས་ཀྱི་རིན་པོ་ཆེའི་མེ་ཏོག་སྣ་ཚོགས་ཀྱི་སྤྲིན་གྲངས་མེད་པའི་ཆར་རབ་ཏུ་འབབ་པའི་རྒྱན་གྱིས་བརྒྱན་པ་དང་། ལྷ་རྫས་ཀྱི་སྤོས་ཀྱི་སྤྲིན་ཁ་དོག་སྣ་ཚོགས་ཀྱི་སྤྲིན་གྲངས་མེད་པའི་ཆར་རབ་ཏུ་འབབ་པའི་རྒྱན་གྱིས་བརྒྱན་པ་དང་། ལྷ་རྫས་ཀྱི་རིན་པོ་ཆེའི་ཕྲེང་བ་སྣ་ཚོགས་ཀྱི་སྤྲིན་གྲངས་མེད་པའི་ཆར་རབ་ཏུ་འབབ་པའི་རྒྱན་གྱིས་བརྒྱན་པ་དང་། ལྷ་རྫས་ཀྱི་ཕྱེ་མ་ཁ་དོག་སྣ་ཚོགས་ཀྱི་སྤྲིན་གྲངས་མེད་པའི་ཆར་རབ་ཏུ་འབབ་པའི་རྒྱན་གྱིས་བརྒྱན་པ་དང་། ལྷ་རྫས་ཀྱི་རིན་པོ་ཆེའི་ལྷབ་ལྷུབ་སྣ་ཚོགས་ཀྱི་སྤྲིན་གྲངས་མེད་པའི་ཆར་རབ་ཏུ་འབབ་པའི་རྒྱན་གྱིས་བརྒྱན་པ་དང་། ལྷ་རྫས་ཀྱི་གོས་སྣ་ཚོགས་དྲི་མ་མེད་ཅིང་འཇམ་པ་ཁ་དོག་རྣམ་པ་ཐ་དད་པའི་སྤྲིན་གྲངས་མེད་པའི་ཆར་རབ་ཏུ་འབབ་པའི་རྒྱན་གྱིས་བརྒྱན་པ་དང་། ལྷ་རྫས་ཀྱི་རིན་པོ་ཆེའི་གདུགས་རྣམ་པར་བྱེ་བ་སྣ་ཚོགས་ཀྱི་སྤྲིན་གྲངས་མེད་པའི་ཆར་རབ་ཏུ་འབབ་པའི་རྒྱན་གྱིས་བརྒྱན་པ་དང་། ལྷ་རྫས་ཀྱི་རིན་པོ་ཆེའི་སེང་གེ་ཡིད་དུ་འོང་བའི་རྒྱལ་མཚན་གྱི་སྤྲིན་གྲངས་མེད་པའི་ཆར་རབ་ཏུ་འབབ་པའི་རྒྱན་གྱིས་བརྒྱན་པ་དང་། ལྷ་རྫས་ཀྱི་རིན་པོ་ཆེ་འབར་བའི་ལྕེ་ཤིན་ཏུ་འཕྲོ་བའི་རིན་པོ་ཆེའི་བ་དན་གྱི་སྤྲིན་གྲངས་མེད་པའི་ཆར་རབ་ཏུ་འབབ་པའི་རྒྱན་གྱིས་བརྒྱན་པར་རྒྱལ་པོ་འོད་ཆེན་པ་ལ་མཆོད་པ་བྱ་བའི་ཕྱིར་བྱིན་གྱིས་བརླབས་སོ།
en: Ten thousand devas, such as the deva lords Śakra, Suyāma, Saṃtuṣita, Sunirmita, and Vaśavartin gathered in the sky facing him and made offerings to King Mahāprabha: The entire expanse of the sky resounded with the vast melodious sound from clouds of a quintillion divine musical instruments. A gathering of countless apsarases created the adornment of sweet, beautiful sounds from clouds of divine songs. There was the adornment of the rain that fell from clouds of a variety of countless divine, precious flowers. There was the adornment of the rain that fell from clouds of a variety of countless divine incenses of various colors. There was the adornment of the rain that fell from clouds of a variety of countless divine, precious garlands. There was the adornment of the rain that fell from clouds of a variety of countless divine powders of various colors. There was the adornment of the rain that fell from clouds of a variety of countless divine, precious jewelry. There was the adornment of the rain that fell from clouds of a variety of countless divine, delicate, stainless clothing.

source: གླང་པོའི་རྒྱལ་པོ་ཆེན་པོ་ཤུགས་འཛིན་གྱིས་ཀྱང་གླང་པོའི་དབང་པོའི་ཁྱུ་མཆོག་གི་མཐུ་ཕྱུང་བ་དང་། རྣམ་པར་འཕྲུལ་པའི་མཐུས་ནམ་མཁའི་དབྱིངས་ཐམས་ཅད་ལྷ་རྫས་ཀྱི་རིན་པོ་ཆེ་སྣ་ཚོགས་ཀྱི་པད་མོའི་སྤྲིན་གྲངས་མེད་པས་ཀུན་ནས་ཡོག་པར་བྱིན་གྱིས་བརླབས་སོ།
en: There was the adornment of the rain that fell from clouds of a variety of countless divine parasols of different kinds. There was the adornment of the rain that fell from clouds of beautiful lion banners. There was the adornment of the rain that fell from clouds of countless precious flags shining with the blazing light of divine jewels. Airāvaṇa and all the kings of elephants were in the sky, and through the inconceivable miraculous powers of the lords of the elephants, the leaders of the herds, they manifested in the sky clouds of a variety of countless divine, precious lotuses that covered the entire expanse of the sky; of countless divine, precious hanging strings of jewels;

source: །ལྷ་རྫས་ཀྱི་ནོར་བུ་རིན་པོ་ཆེའི་སེ་མོ་དོ་གྲངས་མེད་པར་རབ་ཏུ་འཕྱད་བ་དང་། ལྷ་རྫས་ཀྱི་རིན་པོ་ཆེའི་སྣམ་བུའི་ལྡ་ལྡི་དང་། ཆུན་པོ་གྲངས་མེད་པར་རབ་ཏུ་འཕྱང་བ་དང་། ལྷ་རྫས་ཀྱི་རིན་པོ་ཆེ་སྣ་ཚོགས་ཀྱི་ཕྲེང་བའི་རྒྱུད་གྲངས་མེད་པ་མངོན་པར་འཕྱང་བའི་རྒྱན་གྱིས་བརྒྱན་པ་དང་། ལྷ་རྫས་ཀྱི་རིན་པ་ཆེ་སྣ་ཚོགས་ཀྱི་ལྷབ་ལྷུབ་དང་། ཕྲེང་བ་གྲངས་མེད་པ་མངོན་པར་འཕྱང་བའི་རྒྱན་གྱིས་བརྒྱན་པ་དང་། ལྷ་རྫས་ཀྱི་རིན་པོ་ཆེ་སྣ་ཚོགས་ཀྱི་མེ་ཏོག་གི་ལྡ་ལྡི་གྲངས་མེད་པ་མངོན་པར་བྲིས་པའི་རྒྱན་གྱིས་བརྒྱན་པ་དང་། ལྷ་རྫས་སྤོས་ཀྱི་རྒྱལ་པོའི་ཁ་དོག་སྣ་ཚོགས་ཕྱོགས་ཐམས་ཅད་དུ་དྲི་ཞིམ་པོས་རྒྱས་པར་འགེངས་པའི་སྤྲིན་གྲངས་མེད་པས་ཀུན་ནས་ཁེབས་པའི་རྒྱན་གྱིས་བརྒྱན་པ་དང་། ལྷ་རྫས་ཀྱི་རིན་པོ་ཆེའི་གོས་ཁ་དོག་སྣ་ཚོགས་ཀྱི་སྤྲིན་གྲངས་མེད་པའི་ཆར་རབ་ཏུ་འབབ་པའི་རྒྱན་གྱིས་བརྒྱན་པ་དང་། ལྷ་རྫས་ཀྱི་བདུག་སྤོས་ཀྱི་དུད་པ་ན་བུན་དུ་འགྲིགས་པའི་སྤྲིན་གྲངས་མེད་པའི་ཆར་རབ་ཏུ་འབབ་པའི་རྒྱན་གྱིས་བརྒྱན་པ་དང་། ལྷ་རྫས་ཀྱི་ཕྱེ་མ་ཁ་དོག་སྣ་ཚོགས་ཀྱི་སྤྲིན་གྲངས་མེད་པའི་ཆར་ཕྲ་མོ་རབ་ཏུ་འབབ་པའི་རྒྱན་གྱིས་བརྒྱན་པ་དང་། ལྷའི་བུ་མོའི་ཚོགས་ལྷ་རྫས་ཀྱི་རོལ་མོ་བྱེད་པ་དང་། གླུ་སྙན་པའི་དབྱངས་ཡིད་དུ་འོང་བར་ལེན་ཅིང་བསྟོད་པའི་སྤྲིན་གྱིས་ཡོག་པའི་ཆར་མངོན་པར་འབབ་པའི་རྒྱན་གྱིས་བརྒྱན་པར་ནམ་མཁའི་དབྱིངས་བྱིན་གྱིས་བརླབས་སོ།
en: of countless divine, precious hanging clusters of streamers and wreaths; of hanging adornments of countless varieties of divine, precious flower garlands; of hanging adornments of countless varieties of divine, precious strings of jewelry; and of hanging adornments of countless varieties of divine, precious wreaths of flowers; the adornment of sky-covering clouds of perfume composed of countless varieties of divine, precious kings of scents of different colors that filled all directions with a lovely aroma; the adornment of rain from clouds of divine, precious clothing of various colors; the adornment of rain from clouds of a divine mass of incense smoke; the adornment of a delicate rain from clouds of divine powders of different colors; and the adornment of rain from sky-covering clouds of the sweet and melodious music and songs of praise by a host of apsarases.

source: སྲིན་པོའི་དབང་པོ་བརྒྱ་སྟོང་གྲངས་མེད་པ་རྒྱ་མཚོ་ལ་གནས་པ་དང་། གླིང་བཞི་པའི་འཇིག་རྟེན་གྱི་ཁམས་ཀྱི་རྟེན་གྱིས་གཞི་ལ་གནས་པ། ཁ་ཟས་སུ་ཤ་དང་ཁྲག་འཐུང་ཞིང་ཟ་བ། ཆུ་ལ་སྤྱོད་པ་དང་། རི་དགས་དང་། ཕྱུགས་དང་བྱ་དང་བ་ལང་དང་རྟ་དང་། གླང་པོ་དང་བོང་བུ་དང་། སྐྱེས་པ་དང་། བུད་མེད་ཀྱི་ཚོགས་ཀྱི་མདངས་འཕྲོགས་པ། ཞེ་སྡང་བའི་ཡིད་ཀྱི་རྣམ་པར་རྟོག་པ་དང་ལྡན་པ། རྟག་ཏུ་འགྲོ་བ་ལ་འཚེ་ཞིང་འཐོ་འཚམ་པ་ལ་ཞུགས་པ་རྣམས་ཀྱང་བྱམས་པ་དང་། ཕན་པའི་སེམས་དམ་པ་དང་ལྡན་ཞིང་བཞིན་གྱི་མདོག་ཤིན་ཏུ་དང་བ་དང་། འགྲོ་བ་ཐམས་ཅད་ལ་མི་འཚེ་ཞིང་མཐོ་འཚམ་པ་མེད་པ་ལ་ཞུགས་ཏེ།
en: Countless hundreds of thousands of rākṣasa lords who dwell in the sea and on the land, who dwell in our world realm of four continents, whose food is flesh and whose drink is blood, who steal the vitality of those creatures that live in the water and of deer, cattle, birds, oxen, horses, elephants, donkeys, men, and women, whose minds have thoughts of anger and who always harm and injure beings, all gained the highest motivation of love and altruism;

source: འཇིག་རྟེན་ཕ་རོལ་ལ་ལྟ་བར་གྱུར་ནས། ཐལ་མོ་སྦྱར་ཅིང་ཤིན་ཏུ་དགའ་བའི་སེམས་ཀྱིས་རྒྱལ་པོ་འོད་ཆེན་པོ་གང་ན་བ་དེ་ལོགས་སུ་བཏུད་ནས་ཕྱག་འཚལ་བར་གྱུར་ཏོ། །ལུས་དང་སེམས་ཀྱི་བདེ་བ་རྒྱ་ཆེན་པོ་མཚུངས་པ་མེད་པ་ཡང་མྱོང་བར་གྱུར་ཏོ།
en: their faces having become serene, they became dedicated to not causing violence or injury to any being, their thoughts upon the next world after death, and with their palms together in homage, with the highest happiness, they bowed in the direction of King Mahāprabha, experiencing an unequaled vast bliss of mind and body.

source: །གནོད་སྦྱིན་དང་གྲུལ་བུམ་དང་། ཤ་ཟ་དང་འབྱུང་བོའི་དབང་པོ་བརྒྱ་སྟོང་དུ་མ་ཡང་བྱམས་པ་དང་། ཕན་པའི་སེམས་དམ་པ་དང་ལྡན་ཞིང་བཞིན་གྱི་མདོག་ཤིན་ཏུ་དང་བ་དང་། འགྲོ་བ་ཐམས་ཅད་ལ་མི་འཚེ་ཞིང་འཐོ་འཚམ་མེད་པ་ལ་ཞུགས་ཏེ། འཇིག་རྟེན་ཕ་རོལ་ལ་ལྟ་བུར་གྱུར་ནས།
en: Hundreds of thousands of lords of yakṣas, mahoragas, piśācas, and bhūtas with the highest motivation of love and altruism, their faces having become serene and their thoughts upon the next world after death, became dedicated to not causing violence or injury to any being.

source: ཐལ་མོ་སྦྱར་ཅིང་ཤིན་ཏུ་དགའ་བའི་སེམས་ཀྱིས་རྒྱལ་པོ་འོད་ཆེན་པོ་གང་ན་བ་དེར་འདུད་ཅིང་ཕྱག་འཚལ་བར་གྱུར་ཏེ། ལུས་དང་སེམས་ཀྱི་བདེ་བ་རྒྱ་ཆེན་པོ་མཚུངས་པ་མེད་པ་ཡང་མྱོང་བར་གྱུར་ཏོ།
en: With their palms together in homage, with the highest happiness, they bowed in the direction of King Mahāprabha, experiencing an unequaled vast bliss of mind and body.

source: །དེ་ལྟར་གླིང་བཞི་བའི་འཇིག་རྟེན་གྱི་ཁམས་ཐམས་ཅད་ཀྱི་སེམས་ཅན་ཀུན་གྱི་འཇིགས་པ་དང་། གནོད་པ་དང་། མི་བདེ་བ་དང་། ཤར་གཉེར་བ་དང་། ཐབ་མོ་དང་། རྩོད་པ་དང་། སེམས་ཀྱི་འཁྲུག་པ་དང་། འཚེ་བའི་སེམས་ཐམས་ཅད་ཀྱང་རབ་ཏུ་ཞི་བར་གྱུར་ཏོ། །རྣམ་པར་ཞི་བར་གྱུར་ཏོ། །རྣམ་པར་ལོག་པར་གྱུར་ཏོ། །འགགས་པར་གྱུར་ཏོ། །ཕྱིར་ལོག་པར་གྱུར་ཏོ།
en: In the same way, for all beings in the four-continent world realm, fear, misfortune, hostility, disputes, mental disturbances, and violent intentions ceased, were extinguished, were eliminated, were brought to an end, and were eradicated.

source: །གླིང་བཞི་པའི་འཇིག་རྟེན་གྱི་ཁམས་འདིར་ཇི་ལྟ་བ་དེ་བཞིན་དུ་སྟོང་གསུམ་གྱི་སྟོང་ཆེན་པོའི་འཇིག་རྟེན་གྱི། ཁམས་ཐམས་ཅད་ནས། ཕྱོགས་བཅུར་འཇིག་རྟེན་གྱི་ཁམས་བྱེ་བ་ཁྲག་ཁྲིག་བརྒྱ་སྟོང་ཕྲག་བཅུའི་བར་གྱི་སེམས་ཅན་ཀུན་གྱི་འཇིགས་པ་དང་། གནོད་པ་དང་། མི་བདེ་བ་དང་། ཤར་གཉེར་བ་དང་། ཐབ་མོ་དང་། རྩོད་པ་དང་། སེམས་ཀྱི་འཁྲུག་པ་དང་། འཚེ་བའི་སེམས་ཐམས་ཅད་ཀྱང་བྱང་ཆུབ་སེམས་དཔའི་ཏིང་ངེ་འཛིན་བྱམས་པ་ཆེན་པོའི་སྔོན་དུ་འགྲོ་བ། འཇིག་རྟེན་གྱི་དབང་པོའི་ཀློང་གི་ཆོས་ཉིད་ཐོབ་པའི་ཕྱིར། རབ་ཏུ་ཞི་བར་གྱུར་ཏོ། རྣམ་པར་ཞི་བར་གྱུར་ཏོ། རྣམ་པར་ལོག་པར་གྱུར་ཏོ། །འགགས་པར་གྱུར་ཏོ།
en: In the same way as it was for the four-continent world realm, so it was that for all beings throughout the great universe of a billion worlds, throughout a quintillion world realms in the ten directions, all fear, misfortune, hostility, disputes, mental disturbances, and sinful and violent intentions ceased, were extinguished, were eliminated, were brought to an end, and were eradicated through their attaining the nature of the bodhisattva samādhi called exercising power over the world through being motivated by great love

source: ཕྱིར་ལོག་པར་གྱུར་ཏོ། དེ་ནས་རྒྱལ་པོ་འོད་ཆེན་པོ་ཏིང་ངེ་འཛིན་དེ་ལས་ལངས་ཏེ། ཚོང་དཔོན་གྱི་བུ་ནོར་བཟངས་ལ་འདི་སྐད་ཅེས་སྨྲས་སོ། །རིགས་ཀྱི་བུ་ངས་བྱང་ཆུབ་སེམས་དཔའི་སྤྱོད་པའི་ཡེ་ཤེས་སྣང་བའི་སྒོ་བྱམས་པ་ཆེན་པོའི་རྒྱལ་མཚན་འདི་ཤེས་པར་ཟད་ན།
en: Then King Mahāprabha arose from that samādhi and said to Sudhana, the head merchant’s son, “Noble one, I know only this wisdom of bodhisattva conduct called the banner of great love

source: ངས་བྱང་ཆུབ་སེམས་དཔའ་འཇིག་རྟེན་གྱི་ཁམས་ཐམས་ཅད་བདེ་བའི་བསམ་པས་རྒྱས་པར་འགེངས་པས་བྱམས་པ་ཆེན་པོའི་གདུགས་ཚད་མེད་པ་དང་ལྡན་པ། འཁོར་མི་ཕྱེད་པ་དང་ལྡན་པས།
en: “How could I know the conduct or describe the qualities of the bodhisattvas who hold the immeasurable parasol of great love; who pervade all the world realms with their motivation to bring happiness;

source: འགྲོ་བ་ཐམས་ཅད་འཁོར་དུ་གྱུར་པ།
en: who are attendants for all beings through continual attendance to them;

source: རབ་འབྲིང་དང་ཐ་མའི་སྦྱོར་བས་འགྲོ་བ་ཐམས་ཅད་ཡོངས་སུ་བསྐྱབ་པ་ལ་ཞུགས་པ།
en: who are dedicated to the protection of all beings applied equally to the highest, the middling, and the lowest beings;

source: འགྲོ་བ་ཐམས་ཅད་ཡོངས་སུ་བཟུང་བུ་ལ་ཞུགས་པས། བྱམས་པའི་སེམས་ལྟ་བུ་དང་ལྡན་པ།
en: who have a loving motivation that is like the earth, for it is engaged in supporting all beings;

source: བསོད་ནམས་དང་ཡེ་ཤེས་ཀྱི་འོད་ཟེར་འགྲོ་བ་ཐམས་ཅད་དུ་འབྱུང་བས། ཟླ་བ་ཉ་ཞིང་རྒྱས་པ་ལྟ་བུར་གྱུར་པ།
en: who are like the disk of the full moon sending the light rays of merit and wisdom equally to all beings;

source: ཤེས་བྱ་ཐམས་ཅད་ཡེ་ཤེས་ཀྱི་འོད་ཀྱིས་སྣང་བར་བྱེད་པའི་ཕྱིར་ཉི་མའི་དཀྱིལ་འཁོར་ལྟ་བུར་གྱུར་བ།
en: who are like the disk of the sun because they shine the light of wisdom on everything that is to be known;

source: སེམས་ཅན་ཐམས་ཅད་ཀྱི་སེམས་ཀྱི་མུན་པ་ཐིབས་པོ་རབ་ཏུ་སེལ་བས། སྒྲོན་མ་ཆེན་པོ་ལྟ་བུར་གྱུར་པ།
en: who are like lamps because they dispel the deep darkness in the minds of all beings;

source: སེམས་ཅན་ཐམས་ཅད་ཀྱི་སེམས་ཀྱི་མཚོའི་གཡོ་སྒྱུའི་རྙོག་པ་དང་བར་བྱེད་པས། ནོར་བུ་རིན་པོ་ཆེ་ཆུ་འདོད་དང་འདྲ་བ།
en: who are like the precious jewel that purifies water because they clear away the turbidity of deceit and deception in the lakes of the minds of all beings;

source: འགྲོ་བ་ཐམས་ཅད་ཀྱི་བསམ་པ་དང་། སྨོན་ལམ་ཡོངས་སུ་རྫོགས་པར་བྱེད་པས། ནོར་བུ་རིན་པོ་ཆེ་ཡིད་བཞིན་གྱི་རྒྱལ་པོ་དང་འདྲ་བ།
en: who are like the king of wish-fulfilling jewels because they fulfill the aspirations and prayers of all beings;

source: འགྲོ་བ་ཐམས་ཅད་ཏིང་ངེ་འཛིན་དང་། སྙོམས་པར་འཇུག་པའི་ཁང་པ་དང་། ཐམས་ཅད་མཁྱེན་པ་ཉིད་ཀྱི་ཕོ་བྲང་ཆེན་པོར་གཞོག་པས་རླུང་མར་ཆེན་པོ་དང་འདྲ་བ་དེ་དག་གི་སྤྱོད་པ་ཤེས་པའམ།
en: who are like a great wind because they make them live in the dwelling place of resting in samādhi, which is the great city of omniscience?

source: ཡོན་ཏན་བརྗོད་པའམ།
en: “How could I measure their mountain of merit?

source: བསོད་ནམས་ཀྱི་རི་བོ་གཞལ་བའམ། ཡོན་ཏན་གྱི་སྐར་མའི་ཚོགས་ཀྱིས་བརྒྱན་པའི་ནམ་མཁའ་ལ་བལྟ་བའམ།
en: How could I view the sky that is adorned by the myriads of stars of their qualities?

source: སྨོན་ལམ་ཆེན་པོའི་རླུང་གི་དཀྱིལ་འཁོར་ལས་མཚམས་བཅད་པའམ།
en: How could I know the circle of air that is their great prayers?

source: ཆོས་མཉམ་པ་ཉིད་ཀྱི་སྟོབས་ལ་ཚད་གཟུང་བའམ།
en: How could I measure their power of the equality of all phenomena?

source: ཐེག་པ་ཆེན་པོའི་རྒྱན་གྱི་བསྔགས་པ་ཡོངས་སུ་བརྗོད་པའམ།
en: How could I explain their praises of the array of the Mahāyāna?

source: ཀུན་ཏུ་བཟང་པོའི་སྤྱོད་པའི་ཚུལ་གྱི་ཁྱད་པར་བརྗོད་པའམ།
en: How could I describe their special way of completely good conduct?

source: བྱང་ཆུབ་སེམས་དཔའི་ཏིང་ངེ་འཛིན་ཆེན་པོ་བསྒོམ་པའི་སྒོ་དབྱེ་བའམ།
en: How could I reveal the gateway to the great samādhi of the bodhisattvas?

source: སྙིང་རྗེ་ཆེན་པོའི་སྤྲིན་ཡོངས་སུ་སྨོས་པར་ནུས་རེ་སྐན།
en: How could I describe their clouds of great compassion? “Depart, noble one.

source: །སོང་རིགས་ཀྱི་བུ་ལྷོ་ཕྱོགས་ཀྱི་རྒྱུད་འདི་ཉིད་ན་རྒྱལ་པོའི་གནས་བརྟན་པ་ཞེས་བྱ་བ་ཡོད་དེ།
en: In this southern region there is a capital city called Sthirā.

source: དེ་ན་དགེ་བསྙེན་མ་མི་གཡོ་བ་ཞེས་བྱ་བ་འདུག་གིས།
en: There dwells an upāsikā by the name of Acalā.

source: དེའི་གན་དུ་སོང་ལ་ཇི་ལྟར་བྱང་ཆུབ་སེམས་དཔས་བྱང་ཆུབ་སེམས་དཔའི་སྤྱོད་པ་ལ་བསླབ་པར་བྱ་བ་དང་། ཇི་ལྟར་ནན་ཏན་དུ་བྱ་བ་དྲིས་ཤིག །དེ་ནས་ཚོང་དཔོན་གྱི་བུ་ནོར་བཟངས་ཀྱིས་རྒྱལ་པོ་འོད་ཆེན་པོའི་རྐང་པ་གཉིས་ལ་སྤྱི་བོས་ཕྱག་འཚལ་ནས།
en: Go to her and ask her, ‘How should a bodhisattva train in bodhisattva conduct? How should a bodhisattva practice it?’

source: རྒྱལ་པོ་འོད་ཆེན་པོ་ལ་ལན་བརྒྱ་སྟོང་དུ་མར་གཡས་ཕྱོགས་སུ་བསྐོར་བ་བྱས་ཏེ། ཡང་དང་ཡང་བལྟས་ནས། རྒྱལ་པོ་འོད་ཆེན་པོའི་དྲུང་ནས་སོང་ངོ་།། །།སངས་རྒྱས་རྨད་གཅད་ཅེས་བྱ་བ་ཤིན་ཏུ་རྒྱས་པ་ཆེན་པོའི་མདོ། །བམ་པོ་གསུམ་པ།
en: Then Sudhana, the head merchant’s son, bowed his head to the feet of King Mahāprabha, circumambulated King Mahāprabha many hundreds of thousands of times, keeping him to his right, and, looking back again and again, departed from King Mahāprabha.

source: དེ་ནས་ཚོང་དཔོན་གྱི་བུ་ནོར་བཟངས་གྲོང་ཁྱེར་ཆེན་པོ་འོད་བཟང་པོ་ནས་བྱུང་སྟེ་ཡུད་ཙམ་དུ་ལམ་གྱི་འགོ་བཙལ་ནས། རྒྱལ་པོ་འོད་ཆེན་པོའི་གདམས་ངག་དེ་ལ་རྗེས་སུ་བསམ་པ་བྱེད་ཅིང་།
en: Sudhana, the head merchant’s son, left the city of Suprabha , and having followed the road for a little while, he contemplated the instruction given to him by King Mahāprabha:

source: བྱང་ཆུབ་སེམས་དཔའི་སྤྱོད་པའི་ཚུལ་བྱམས་པ་ཆེན་པོའི་རྒྱལ་མཚན་དེ་རྗེས་སུ་དྲན་པར་བྱ་བ་དང་། ཏིང་ངེ་འཛིན་གྱི་སྒོ་འཇིག་རྟེན་གྱི་དབང་པོའི་གློང་གིས་སྣང་བ་ཆེན་པོ་དེ་ཡོངས་སུ་བསྒོམ་པ་དང་། བྱང་ཆུབ་སེམས་དཔའ་ལུས་རྣམ་པར་དག་པ།
en: he remembered the way of bodhisattva conduct called the banner of great love ; he meditated on the light of the great samādhi called exercising power over the world

source: བསམ་གྱིས་མི་ཁྱབ་པས་བརྒྱན་པའི་སེང་གེའི་ཁྲིའི་རྒྱན་རྣམ་པར་ཕྱེ་བ།
en: he realized the variegated display of the lion throne and adornments of the pure bodhisattva body;

source: རྣམ་པ་སྣ་ཚོགས་དེ་དག་མངོན་པར་བསྒྲུབ་པ་དང་། བྱང་ཆུབ་སེམས་དཔའི་སྨོན་ལམ་དང་། བསོད་ནམས་ཀྱི་དབང་དང་། སྟོབས་བསམ་གྱིས་མི་ཁྱབ་པ།
en: he increased the inconceivable power and strength of bodhisattva aspiration and merit;

source: དེ་དག་རྗེས་སུ་སྤེལ་བ་དང་། བྱང་ཆུབ་སེམས་དཔའ་སེམས་ཅན་ཡོངས་སུ་སྨིན་པར་བྱ་བའི་ཡེ་ཤེས་ཀྱི་ཚུལ་བསམ་གྱིས་མི་ཁྱབ་པ་དེ་ཤིན་ཏུ་བསྟན་པར་བྱ་བ་དང་། བྱང་ཆུབ་སེམས་དཔའི་ལོངས་སྤྱོད་ཀྱི་བདག་ཉིད་ཆེ་བ་ཐུན་མོང་དུ་གྱུར་པ།
en: he made firm the inconceivable way of bodhisattva wisdom that ripens beings; he reflected upon the inconceivable greatness of the general enjoyments of the bodhisattvas;

source: བསམ་གྱིས་མི་ཁྱབ་པ་དེ་ལ་རྗེས་སུ་བསམ་པ་དང་། བྱང་ཆུབ་སེམས་དཔའི་གནས་རྣམ་པ་ཐ་དད་པ་བསམ་གྱིས་མི་ཁྱབ་པ་དེ་དག་ཀྱང་མཚན་མར་བྱ་བ་དང་། བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ཀྱིས་སེམས་ཅན་ཡོངས་སུ་སྨིན་པར་བྱ་བ་རྣམ་པར་དག་པ་བསམ་གྱིས་མི་ཁྱབ་པ་དེ།
en: he considered the inconceivable different aspects of the bodhisattvas; he remembered the inconceivable pure ripening of beings by bodhisattvas;

source: རྗེས་སུ་དྲན་པར་བྱ་བ་དང་བྱང་ཆུབ་སེམས་དཔའི་འཁོར་ཕུན་སུམ་ཚོགས་ཤིང་ཡོངས་སུ་དག་པ་དེ་ལ་བརྟག་པ་དང་། བྱང་ཆུབ་སེམས་དཔའི་སེམས་ཅན་གྱི་དོན་བསམ་པ་སྣང་བའི་ཚུལ་བསམ་གྱིས་མི་ཁྱབ་པ་དེ་ལ་ཡིད་ཆེས་པར་བྱེད་བྱེད་པས།
en: he thought about the inconceivable pure and perfect bodhisattva assembly of pupils; he had conviction in the inconceivable radiance of the bodhisattvas’ dedication to their duty to beings;

source: སེམས་དགའ་ཞིང་མོས་པའི་ཤུགས་དང་། སེམས་ཀྱི་ཉམས་བདེ་བ་དང་། སེམས་ཤིན་ཏུ་ཚིམ་པ་དང་། སེམས་ཁོང་ནས་དགའ་བ་དང་། སེམས་རྙོག་པ་མེད་པ་དང་། སེམས་འོད་དང་བ་དང་། སེམས་བརྟན་པ་དང་། སེམས་རྒྱ་ཆེ་བ་དང་། སེམས་མི་ཟད་པ་ཐོབ་སྟེ།
en: and he attained happiness, powerful attraction, delight, contentment, deep joy, clarity of mind, brightness of mind, stability of mind, vastness of mind, and inexhaustibility of mind.

source: དེ་དེ་ལྟར་དགེ་བའི་བཤེས་གཉེན་རྗེས་སུ་དྲན་ཞིང་ཡིད་ལ་བྱེད་པ་ལ་བརྩོན་པས།
en: He was in that way dedicated to remembering and thinking of the kalyāṇamitra.

source: གདོང་མཆི་མས་གང་ནས་རྗེས་སུ་སེམས་པ།
en: With his face covered in tears, he thought “Ah!

source: ཀྱི་ཧུད་ཀྱེ་དགེ་བའི་བཤེས་གཉེན་མཐོང་བ་འདི་ནི་ཡོན་ཏན་རིན་པ་ཆེ་ཐམས་ཅད་ཀྱི་འབྱུང་གནས་སུ་གྱུར་པའོ།
en: Seeing the kalyāṇamitra is the source of all precious qualities.

source: །བྱང་ཆུབ་སེམས་དཔའི་སྤྱོད་པ་ཐམས་ཅད་ཡོངས་ས་དག་པ་དང་། ཡོངས་སུ་རྫོགས་པར་འགྱུར་བའི་རྒྱུར་གྱུར་པའོ།
en: It perfects and purifies all bodhisattva conduct.

source: །བྱང་ཆུབ་སེམས་དཔའི་དྲན་པ་ཐམས་ཅད་རྣམ་པར་དག་པར་བྱེད་པའོ།
en: It makes pure all bodhisattva mindfulness.

source: །བྱང་ཆུབ་སེམས་དཔའི་གཟུངས་ཀྱི་དཀྱིལ་འཁོར་ཐམས་ཅད་ཡོངས་སུ་སྦྱོང་བའོ།
en: It purifies all the domains of bodhisattva retention.

source: །བྱང་ཆུབ་སེམས་དཔའི་ཏིང་ངེ་འཛིན་གྱི་སྣང་བ་ཐམས་ཅད་ཡོངས་སུ་བསྐྱེད་པའོ་སངས་རྒྱས་ཐམས་ཅད་མཐོང་བར་འགྱུར་བ་ཡོངས་སུ་སྒྲུབ་པའོ།
en: It gives rise to the radiance of all bodhisattva samādhis. It accomplishes seeing all buddhas.

source: །སངས་རྒྱས་ཀྱི་ཆོས་ཐམས་ཅད་ཀྱི་སྤྲིན་གྱི་ཆར་རབ་ཏུ་འབེབས་པའོ།
en: It brings down the rain from the Dharma clouds of all the buddhas.

source: །བྱང་ཆུབ་སེམས་དཔའི་སྨོན་ལམ་གྱི་ཚུལ་ཐམས་ཅད་རབ་ཏུ་བརྗོད་པའོ།
en: It indicates the way of all bodhisattva prayers.

source: །ཤེས་རབ་དང་ཡེ་ཤེས་ཀྱི་སྣང་བ་བསམ་གྱིས་མི་ཁྱབ་པར་ཡང་དག་པར་སྐྱེད་པའོ།
en: It gives rise to the inconceivable light of knowledge and wisdom.

source: །བྱང་ཆུབ་སེམས་དཔའི་དབང་པོ་བརྟན་པའི་མྱི་གུ་སྐྱེད་པར་བྱེད་པའོ།
en: It grows the sprouts of stable bodhisattva faculties.

source: །དགེ་བའི་བཤེས་གཉེན་རྣམས་ནི་བདག་ངན་སོང་གི་གཡང་ས་ཐམས་ཅད་ནས་སྐྱོབ་པའོ།
en: The kalyāṇamitras save me from falling into the chasm of the lower existences.

source: དགེ་བའི་བཤེས་གཉེན་རྣམས་ནི་བདག་ཆོས་མཉམ་པ་ཉིད་ཀྱི་ཚུལ་ཁོང་དུ་ཆུད་པར་བྱ་བ་ལ་གཞོག་པའོ།
en: The kalyāṇamitras have brought me to the realization of the way of the equality of phenomena.

source: །དགེ་བའི་བཤེས་གཉེན་རྣམས་ནི་བདག་ལ་ལམ་བདེ་བ་དང་། མི་བདེ་བ་སྟོན་པའོ།
en: The kalyāṇamitras have shown me the paths to happiness and to unhappiness.

source: དགེ་བའི་བཤེས་གཉེན་རྣམས་ནི་བདག་ལ་ཐེག་པ་ཆེན་པོ་ཡོངས་སུ་སྟོན་པའོ།
en: The kalyāṇamitras have taught me the Mahāyāna.

source: །དགེ་བའི་བཤེས་གཉེན་རྣམས་ནི་བདག་ལ་བྱང་ཆུབ་སེམས་དཔའ་ཀུན་ཏུ་བཟང་པོའི་སྤྱོད་པའི་གདམས་ངག་གིས་འདེམས་པའོ།
en: The kalyāṇamitras have given me the instructions on the completely good bodhisattva conduct.

source: །དགེ་བའི་བཤེས་གཉེན་རྣམས་ནི་བདག་ལ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་ཀྱི་གྲོང་ཁྱེར་གྱི་ལམ་སྟོན་པའོ།
en: The kalyāṇamitras have shown me the road to the city of omniscience.

source: །དགེ་བའི་བཤེས་གཉེན་རྣམས་ནི་བདག་ཐམས་ཅད་མཁྱེན་པའི་གནས་སུ་ཕྱིན་པར་སྐྱེལ་བའོ།
en: The kalyāṇamitras have guided me on the way to the town of omniscience.

source: །དགེ་བའི་བཤེས་གཉེན་རྣམས་ནི་བདག་ཆོས་ཀྱི་དབྱིངས་ཀྱི་ཚུལ་རྒྱ་མཚོ་ལ་འཇུག་པར་བྱེད་པའོ།
en: The kalyāṇamitras have made me enter the ocean of the ways of the realm of the Dharma.

source: དགེ་བའི་བཤེས་གཉེན་རྣམས་ནི་བདག་ལ་དུས་གསུམ་གྱི་ཤེས་བྱ་རྒྱ་མཚོའི་ཚུལ་རབ་ཏུ་སྟོན་པའོ།
en: The kalyāṇamitras have taught me the ways of an ocean of what is to be known in the three times.

source: །དགེ་བའི་བཤེས་གཉེན་རྣམས་ནི་བདག་ལ་འཕགས་པའི་ཚོགས་ཀྱི་དཀྱིལ་འཁོར་ཐམས་ཅད་རབ་ཏུ་སྟོན་པའོ། །དགེ་བའི་བཤེས་གཉེན་རྣམས་ནི་བདག་གི་དཀར་པོའི་ཆོས་ཐམས་ཅད་རྣམ་པར་འཕེལ་བར་བྱེད་པའོ་ཞེས་དེ་དེ་ལྟར་དུ་ཞིང་སྨྲེ་སྔགས་འདོན་པའི་ཚེ།
en: The kalyāṇamitras have shown me all the circles of ārya assemblies. The kalyāṇamitras have increased all my good qualities.”
